## Pandas DataFrame

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame()
print(df1)

Empty DataFrame
Columns: []
Index: []

In [3]:
list = ['a','b','c','d','e']
df1 = pd.DataFrame(list)
print(df1)

   0
0  a
1  b
2  c
3  d
4  e

In [4]:
df1

   0
0  a
1  b
2  c
3  d
4  e

In [5]:
lst = [[1,2,3],[4,5,6],[7,8,9]]
df2 = pd.DataFrame(lst)

In [6]:
df2

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
dct = {'Roll No':[1,2,3,4], 'Name':['Barry','Iris','Caitlin','Cisco']}
df3 = pd.DataFrame(dct)

In [12]:
df3

   Roll No     Name
0        1    Barry
1        2     Iris
2        3  Caitlin
3        4    Cisco

In [13]:
dct = [{'a':1,'b':2},{'a':6,'b':0}]
df4 = pd.DataFrame(dct)
df4

   a  b
0  1  2
1  6  0

In [14]:
dct = [{'a':1,'b':2},{'a':6,'b':0,'c':7}]
df4 = pd.DataFrame(dct)
df4

   a  b    c
0  1  2  NaN
1  6  0  7.0

In [15]:
dct2 = {'Roll no':pd.Series([1,2,3]), 'Name':pd.Series(['Barry','Iris','Caitlin','Cisco'])}
df5 = pd.DataFrame(dct2)
df5

   Roll no     Name
0      1.0    Barry
1      2.0     Iris
2      3.0  Caitlin
3      NaN    Cisco